const BLOG_CONFIG = {
  title: "seyedisu",
  subtitle: "نوشته‌ها",
  language: "fa",
  author: "seyed",

  profile: {
    name: "seyed",
    bio: "Economist Programmer",
    avatar: "https://avatars.githubusercontent.com/u/293959093",
    links: [
      { label: "GitHub", url: "https://github.com/seyedisu", icon: "github" },
      { label: "Instagram", url: "https://instagram.com/this.is.seyed.parsa", icon: "instagram" },
      { label: "ble", url: "https://ble.ir/seyedisu", icon: "ble" }
    ]
  },

  postsPerPage: 5,

  get categories() {
    const cats = new Set(this.posts.map(p => p.category).filter(Boolean));
    return ["همه", ...cats];
  },

  posts: [
    {
      id: 0,
      title: "ساخت وبلاگ جدید",
      date: "1406/03/27",
      category: "عمومی",
      pages: [
        `بلاخره این چیز باحال تموم شدش!
        من از بچگی (حدود کلاس پنجم ششم) یه وبلاگ داشتم که توش مینوشتم. دقیق یادم نیست اسمش چی بود. ولی خب مینوشتم دیگه :)
        یه مدت بعد توی دانشگاه که اومدم، یه وبلاگ به یه هویت واقعی رو برا خودم درست کردم. که توی وبلاگ قبلی از مراحل ساختنش کلی نوشته بودم! حتی اینکه با چه مکافاتی توش مینوشتم!
        پ.ن: همچنان با همون مکافات دارم مینویسم! به صورت جدی باید یه برنامه بنویسم که مسیر نوشتن رو خیلی ساده تر کنه برام :)
        بعدش وقتی نگاش میکردم، میدیدم ببین! واقعا از این بدتر نمیشه! ینی کی میتونه از این وبلاگ بدتر درست کنه؟؟
        تا اینکه شروع کردم ساختن این یکی، با کلی قابلیتای جدید :)
        مثلا ورق زدن صفحه! الان اگه با گوشی هستی دستتو به سمت چپ تا بریم صفحه بعد!`,
        `خبب! اینم صفحه بعد :) خیلی باحاله. میشه موضوعات مختلف رو توی صفحات مختلف در قالب یه پست بنویسم.
        یکی دیگه از قابلیتا کتگوریه! الان میتونم کتگوری بسازم و این حرفا دیگه!
        یکی دیگه از قابلیتا دارک مود و لایت مودشه :) بالا سمت چپ بزن روی اون آیکونه!
        دیدی؟ همه چی فیروزه ای شد. حالا یه بار دیگه بزن!
        همه چی سفید شد :)
        خلاصه که خیلی باحال شده`,
        `فک کنم دیگه بیشتر از این نیاز نیست بنویس! بریم ببینیم چی میشه. ایشالا که اینترنتا هم قطع نشه! چون همه چی این سایته اونوره :) از دی ان اسش تا سرورش ....`,
        `یام یام :)`,
      ]
    },



    
    // {
    //   id: 0,
    //   title: "",
    //   date: "",
    //   category: "",
    //   pages: [
    //     ``,
    //     ``,
    //   ]
    // },
  ]
};
